# You can use this code  as a template as a blank to connect  sqlite3 to use this database to data manipulation

sqlite3 by default in google colab has an old version of 3.22 We need version 3.25 because window functions appeared in it. And we analytics without equestrian functions are nowhereаздел

In [ ]:

! gdown 1CDqqyKV9BvrvnuR1l8HVz0aYuM4yOTUr
! mv _sqlite3.cpython-38-x86_64-linux-gnu.so /usr/lib/python3.8/lib-dynload/
import os
os.kill(os.getpid(), 9)

Downloading...
From: https://drive.google.com/uc?id=1CDqqyKV9BvrvnuR1l8HVz0aYuM4yOTUr
To: /content/_sqlite3.cpython-38-x86_64-linux-gnu.so
100% 6.59M/6.59M [00:00<00:00, 106MB/s]

In [3]:
import pandas as pd
import numpy as np

import sqlite3

con = sqlite3.connect('db')

In [4]:
sqlite3.sqlite_version

'3.31.1'

In [5]:
df = pd.read_csv('/content/test_data.csv')
df.head

<bound method NDFrame.head of      age     sex  job housing saving_accounts checking_account  credit_amount  \
0     33    male    2     own             NaN              NaN           3074
1     43    male    1     own          little           little           1344
2     52    male    2     own      quite rich              NaN            936
3     35  female    3     own          little              NaN           1393
4     28    male    2     own          little              NaN            776
..   ...     ...  ...     ...             ...              ...            ...
995   65    male    2    free          little           little           2600
996   30    male    3     own          little         moderate           4455
997   33    male    2     own          little         moderate           6403
998   29  female    2     own             NaN              NaN           5003
999   44    male    2     own        moderate         moderate           1804

     duration    purpose  default          contract_dt  client_id
0           9   radio/TV        0  2008-06-29 18:52:00        210
1          12        car        0  2007-05-20 18:30:19        929
2           9  education        0  2008-04-27 08:23:07        200
3          11        car        0  2007-05-06 10:58:22         45
4          12   radio/TV        0  2007-07-21 13:22:14        358
..        ...        ...      ...                  ...        ...
995        18   radio/TV        1  2007-12-16 20:17:19        624
996        36   business        1  2007-07-12 14:08:58        181
997        24   radio/TV        0  2008-04-08 03:24:26        730
998        21        car        1  2007-11-29 15:51:45        557
999        12        car        0  2007-08-14 09:05:33         23

[1000 rows x 12 columns]>

In [6]:
df['contract_dt'] = pd.to_datetime(df['contract_dt'],format='%Y-%m-%d %H:%M:%S')
df.dtypes

age                          int64
sex                         object
job                          int64
housing                     object
saving_accounts             object
checking_account            object
credit_amount                int64
duration                     int64
purpose                     object
default                      int64
contract_dt         datetime64[ns]
client_id                    int64
dtype: object

In [7]:
df.to_sql('test_data', con ,index=False, if_exists='replace')

1000

In [8]:
def get_select(sql):
  return pd.read_sql(sql,con)

In [9]:

sql = '''SELECT t.age * 3 AS age_mult3,
       t.housing
FROM test_data AS t
'''

In [10]:
get_select(sql)

     age_mult3 housing
0           99     own
1          129     own
2          156     own
3          105     own
4           84     own
..         ...     ...
995        195    free
996         90     own
997         99     own
998         87     own
999        132     own

[1000 rows x 2 columns]